app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."sessionid" = $1 LIMIT 1  [["sessionid", "9fc7ba2d19a47fcab5b7a5a9832c5dff"]]
INSERT INTO "users" ("sessionid", "startTime", "endTime", "input") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sessionid", "9fc7ba2d19a47fcab5b7a5a9832c5dff"], ["startTime", "2018-12-26 19:15:37 +0100"], ["endTime", "2018-12-26 19:15:37 +0100"], ["input", " "]]
UPDATE "users" SET "endTime" = $1, "input" = $2 WHERE "users"."id" = $3  [["endTime", "2018-12-26 19:15:43 +0100"], ["input", " ;Hello;Hallo"], ["id", 1]]
---
    def sendMessage

      session[:dialogflow] = "active"

      # Create new Dialogflow client
      project_id = Rails.configuration.dialogflow['project_id']
      language_code = Rails.configuration.dialogflow['language_code']
      session_id = session[:session_id]
      session_client = Google::Cloud::Dialogflow::Sessions.new
      session = session_client.class.session_path project_id, session_id

      # Set start time for db entries
      startTime = Time.now+1.hour

      # Create or update db entries
      if User.find_by(sessionid: session_id).nil?
          User.create(sessionid: session_id, startTime: startTime, endTime: startTime, input: " ")
      end
      currentUser = User.find_by(sessionid: session_id)
      User.find_by(sessionid: session_id).update(endTime: startTime,input: currentUser["input"] +"; "+ params[:message_input_field])